```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.app.aws_acm_certificate.url_cert: Refreshing state... [id=arn:aws:acm:us-east-1:110877218140:certificate/47f16f31-03b3-4e0f-950a-d227990bef0a]
module.app.data.aws_iam_account_alias.current: Refreshing state...
module.app.data.aws_ssm_parameter.s3_cloudfront_connection: Refreshing state...
module.app.aws_s3_bucket.secondary_site[0]: Refreshing state... [id=maps-dev.byu.edu]
module.app.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::110877218140:policy/lambda_logging]
module.app.aws_ses_domain_identity.domain: Refreshing state... [id=map-dev.byu.edu]
data.aws_route53_zone.hosted_zone: Refreshing state...
module.app.aws_iam_policy.send_email_lambda: Refreshing state... [id=arn:aws:iam::110877218140:policy/terraform-20200605011259277300000001]
module.app.data.aws_caller_identity.current: Refreshing state...
module.app.aws_api_gateway_rest_api.email_api: Refreshing state... [id=bo2lmoe28h]
module.app.aws_s3_bucket.static-website: Refreshing state... [id=campus-map-ui-dev-dev-s3staticsite]
module.app.aws_iam_role.cloudwatch: Refreshing state... [id=api_gateway_cloudwatch_global]
module.app.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.app.aws_api_gateway_account.apigw_account: Refreshing state... [id=api-gateway-account]
module.app.aws_iam_role_policy.cloudwatch: Refreshing state... [id=api_gateway_cloudwatch_global:default]
module.app.aws_iam_role_policy_attachment.email_policy_attachment: Refreshing state... [id=iam_for_lambda-20200605011259659500000002]
module.app.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20200605011259743900000003]
module.app.aws_ses_domain_dkim.domain: Refreshing state... [id=map-dev.byu.edu]
module.app.aws_route53_record.url_cert_validation: Refreshing state... [id=Z00268831ZKN0G19PUG6G__44e7b3ec41ee1ca67905a8e8e21fbfe6.map-dev.byu.edu._CNAME]
module.app.aws_route53_record.domain_verification: Refreshing state... [id=Z00268831ZKN0G19PUG6G__amazonses.example.com_TXT]
module.app.aws_route53_record.amazonses_dkim_record[2]: Refreshing state... [id=Z00268831ZKN0G19PUG6G_waqxbop5swzwvxcgaonrkcimabg3mby3._domainkey.example.com_CNAME]
module.app.aws_route53_record.amazonses_dkim_record[1]: Refreshing state... [id=Z00268831ZKN0G19PUG6G_gyfemcho5avzdz6ythfurvdo4fxd34oy._domainkey.example.com_CNAME]
module.app.aws_route53_record.amazonses_dkim_record[0]: Refreshing state... [id=Z00268831ZKN0G19PUG6G_pwj4hpqy5fhlrvgtp53xpqdu5ywvn5hy._domainkey.example.com_CNAME]
module.app.aws_api_gateway_resource.rest_resource: Refreshing state... [id=zegiwn]
module.app.aws_acm_certificate_validation.cert: Refreshing state... [id=2020-06-05 01:16:14 +0000 UTC]
module.app.aws_api_gateway_resource.resource: Refreshing state... [id=l6bomw]
module.app.aws_api_gateway_method.method: Refreshing state... [id=agm-bo2lmoe28h-l6bomw-ANY]
module.app.data.aws_iam_policy_document.static_website_read_with_secret: Refreshing state...
module.app.aws_s3_bucket_policy.static_website_read_with_secret: Refreshing state... [id=campus-map-ui-dev-dev-s3staticsite]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.app.data.aws_iam_policy_document.static_website_read_with_secret will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "static_website_read_with_secret"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::campus-map-ui-dev-dev-s3staticsite/*",
            ]
          + sid       = "1"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "Q5Ukg9tI3OzgGIpP",
                ]
              + variable = "aws:UserAgent"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.app.aws_acm_certificate.url_cert will be updated in-place
  ~ resource "aws_acm_certificate" "url_cert" {
        arn                       = "arn:aws:acm:us-east-1:110877218140:certificate/47f16f31-03b3-4e0f-950a-d227990bef0a"
        domain_name               = "map-dev.byu.edu"
        domain_validation_options = [
            {
                domain_name           = "map-dev.byu.edu"
                resource_record_name  = "_44e7b3ec41ee1ca67905a8e8e21fbfe6.map-dev.byu.edu."
                resource_record_type  = "CNAME"
                resource_record_value = "_ba85d0ca4996753ef15bcccc35cfe456.kirrbxfjtw.acm-validations.aws."
            },
        ]
        id                        = "arn:aws:acm:us-east-1:110877218140:certificate/47f16f31-03b3-4e0f-950a-d227990bef0a"
        status                    = "ISSUED"
        subject_alternative_names = []
      ~ tags                      = {
          + "app"              = "campus-map-ui-dev"
          + "data-sensitivity" = "public"
          + "env"              = "dev"
          + "repo"             = "https://github.com/byu-oit/campus-map-ui"
          + "team"             = "OIT-BYU-APPS-CUSTOM"
        }
        validation_emails         = []
        validation_method         = "DNS"

        options {
            certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.app.aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "bo2lmoe28h"
      + stage_name    = "dev"
    }

  # module.app.aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "l6bomw"
      + rest_api_id             = "bo2lmoe28h"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.app.aws_api_gateway_method_settings.method_settings will be created
  + resource "aws_api_gateway_method_settings" "method_settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "bo2lmoe28h"
      + stage_name  = "dev"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = (known after apply)
          + throttling_rate_limit                      = (known after apply)
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.app.aws_api_gateway_rest_api.email_api will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "email_api" {
        api_key_source           = "HEADER"
        arn                      = "arn:aws:apigateway:us-west-2::/restapis/bo2lmoe28h"
        binary_media_types       = []
        created_date             = "2020-06-05T01:12:59Z"
        execution_arn            = "arn:aws:execute-api:us-west-2:110877218140:bo2lmoe28h"
        id                       = "bo2lmoe28h"
        minimum_compression_size = -1
        name                     = "campus-map-ui-dev-send-email-api"
        root_resource_id         = "jnooulekr5"
      ~ tags                     = {
          + "app"              = "campus-map-ui-dev"
          + "data-sensitivity" = "public"
          + "env"              = "dev"
          + "repo"             = "https://github.com/byu-oit/campus-map-ui"
          + "team"             = "OIT-BYU-APPS-CUSTOM"
        }

        endpoint_configuration {
            types            = [
                "REGIONAL",
            ]
            vpc_endpoint_ids = []
        }
    }

  # module.app.aws_cloudfront_distribution.cdn will be created
  + resource "aws_cloudfront_distribution" "cdn" {
      + active_trusted_signers         = (known after apply)
      + aliases                        = [
          + "map-dev.byu.edu",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "CDN for campus-map-ui-dev S3 Bucket and API"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "app"              = "campus-map-ui-dev"
          + "data-sensitivity" = "public"
          + "env"              = "dev"
          + "repo"             = "https://github.com/byu-oit/campus-map-ui"
          + "team"             = "OIT-BYU-APPS-CUSTOM"
        }
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "campus-map-ui-dev-dev-s3staticsite"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = false

              + cookies {
                  + forward = "none"
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "/rest/*"
          + target_origin_id       = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = false

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + domain_name = "campus-map-ui-dev-dev-s3staticsite.s3-website-us-west-2.amazonaws.com"
          + origin_id   = "campus-map-ui-dev-dev-s3staticsite"

          + custom_header {
              + name  = "User-Agent"
              + value = "Q5Ukg9tI3OzgGIpP"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "bo2lmoe28h.execute-api.us-west-2.amazonaws.com"
          + origin_id   = (known after apply)
          + origin_path = "/dev"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:110877218140:certificate/47f16f31-03b3-4e0f-950a-d227990bef0a"
          + minimum_protocol_version = "TLSv1.1_2016"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.app.aws_cloudwatch_log_group.email_api_logs will be created
  + resource "aws_cloudwatch_log_group" "email_api_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "API-Gateway-Execution-Logs_bo2lmoe28h/dev"
      + retention_in_days = 7
      + tags              = {
          + "app"              = "campus-map-ui-dev"
          + "data-sensitivity" = "public"
          + "env"              = "dev"
          + "repo"             = "https://github.com/byu-oit/campus-map-ui"
          + "team"             = "OIT-BYU-APPS-CUSTOM"
        }
    }

  # module.app.aws_iam_role.cloudwatch will be updated in-place
  ~ resource "aws_iam_role" "cloudwatch" {
        arn                   = "arn:aws:iam::110877218140:role/api_gateway_cloudwatch_global"
        assume_role_policy    = jsonencode(
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "apigateway.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        create_date           = "2020-06-05T01:12:59Z"
        force_detach_policies = false
        id                    = "api_gateway_cloudwatch_global"
        max_session_duration  = 3600
        name                  = "api_gateway_cloudwatch_global"
        path                  = "/"
        permissions_boundary  = "arn:aws:iam::110877218140:policy/iamRolePermissionBoundary"
      ~ tags                  = {
          + "app"              = "campus-map-ui-dev"
          + "data-sensitivity" = "public"
          + "env"              = "dev"
          + "repo"             = "https://github.com/byu-oit/campus-map-ui"
          + "team"             = "OIT-BYU-APPS-CUSTOM"
        }
        unique_id             = "AROARTUGMCVOKOMUDABCT"
    }

  # module.app.aws_iam_role.iam_for_lambda will be updated in-place
  ~ resource "aws_iam_role" "iam_for_lambda" {
        arn                   = "arn:aws:iam::110877218140:role/iam_for_lambda"
        assume_role_policy    = jsonencode(
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        create_date           = "2020-06-05T01:12:59Z"
        force_detach_policies = false
        id                    = "iam_for_lambda"
        max_session_duration  = 3600
        name                  = "iam_for_lambda"
        path                  = "/"
        permissions_boundary  = "arn:aws:iam::110877218140:policy/iamRolePermissionBoundary"
      ~ tags                  = {
          + "app"              = "campus-map-ui-dev"
          + "data-sensitivity" = "public"
          + "env"              = "dev"
          + "repo"             = "https://github.com/byu-oit/campus-map-ui"
          + "team"             = "OIT-BYU-APPS-CUSTOM"
        }
        unique_id             = "AROARTUGMCVOGLDOPNF2R"
    }

  # module.app.aws_lambda_function.email_lambda will be created
  + resource "aws_lambda_function" "email_lambda" {
      + arn                            = (known after apply)
      + function_name                  = "campus-map-ui-dev-email-lambda"
      + handler                        = "sendEmail.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::110877218140:role/iam_for_lambda"
      + runtime                        = "nodejs10.x"
      + s3_bucket                      = "campus-map-ui-dev-dev-s3staticsite"
      + s3_key                         = "sendEmail.zip"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "app"              = "campus-map-ui-dev"
          + "data-sensitivity" = "public"
          + "env"              = "dev"
          + "repo"             = "https://github.com/byu-oit/campus-map-ui"
          + "team"             = "OIT-BYU-APPS-CUSTOM"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.app.aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action        = "lambda:InvokeFunction"
      + function_name = "campus-map-ui-dev-email-lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:us-west-2:110877218140:bo2lmoe28h/*/*/*"
      + statement_id  = "AllowAPIGatewayInvoke"
    }

  # module.app.aws_route53_record.amazonses_dkim_record[0] must be replaced
-/+ resource "aws_route53_record" "amazonses_dkim_record" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "pwj4hpqy5fhlrvgtp53xpqdu5ywvn5hy._domainkey.example.com.map-dev.byu.edu" -> (known after apply)
      ~ id              = "Z00268831ZKN0G19PUG6G_pwj4hpqy5fhlrvgtp53xpqdu5ywvn5hy._domainkey.example.com_CNAME" -> (known after apply)
      ~ name            = "pwj4hpqy5fhlrvgtp53xpqdu5ywvn5hy._domainkey.example.com" -> "pwj4hpqy5fhlrvgtp53xpqdu5ywvn5hy._domainkey.map-dev.byu.edu" # forces replacement
        records         = [
            "pwj4hpqy5fhlrvgtp53xpqdu5ywvn5hy.dkim.amazonses.com",
        ]
        ttl             = 600
        type            = "CNAME"
        zone_id         = "Z00268831ZKN0G19PUG6G"
    }

  # module.app.aws_route53_record.amazonses_dkim_record[1] must be replaced
-/+ resource "aws_route53_record" "amazonses_dkim_record" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "gyfemcho5avzdz6ythfurvdo4fxd34oy._domainkey.example.com.map-dev.byu.edu" -> (known after apply)
      ~ id              = "Z00268831ZKN0G19PUG6G_gyfemcho5avzdz6ythfurvdo4fxd34oy._domainkey.example.com_CNAME" -> (known after apply)
      ~ name            = "gyfemcho5avzdz6ythfurvdo4fxd34oy._domainkey.example.com" -> "gyfemcho5avzdz6ythfurvdo4fxd34oy._domainkey.map-dev.byu.edu" # forces replacement
        records         = [
            "gyfemcho5avzdz6ythfurvdo4fxd34oy.dkim.amazonses.com",
        ]
        ttl             = 600
        type            = "CNAME"
        zone_id         = "Z00268831ZKN0G19PUG6G"
    }

  # module.app.aws_route53_record.amazonses_dkim_record[2] must be replaced
-/+ resource "aws_route53_record" "amazonses_dkim_record" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "waqxbop5swzwvxcgaonrkcimabg3mby3._domainkey.example.com.map-dev.byu.edu" -> (known after apply)
      ~ id              = "Z00268831ZKN0G19PUG6G_waqxbop5swzwvxcgaonrkcimabg3mby3._domainkey.example.com_CNAME" -> (known after apply)
      ~ name            = "waqxbop5swzwvxcgaonrkcimabg3mby3._domainkey.example.com" -> "waqxbop5swzwvxcgaonrkcimabg3mby3._domainkey.map-dev.byu.edu" # forces replacement
        records         = [
            "waqxbop5swzwvxcgaonrkcimabg3mby3.dkim.amazonses.com",
        ]
        ttl             = 600
        type            = "CNAME"
        zone_id         = "Z00268831ZKN0G19PUG6G"
    }

  # module.app.aws_route53_record.custom-url-4a will be created
  + resource "aws_route53_record" "custom-url-4a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "map-dev.byu.edu"
      + type            = "AAAA"
      + zone_id         = "Z00268831ZKN0G19PUG6G"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.app.aws_route53_record.custom-url-a will be created
  + resource "aws_route53_record" "custom-url-a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "map-dev.byu.edu"
      + type            = "A"
      + zone_id         = "Z00268831ZKN0G19PUG6G"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.app.aws_route53_record.domain_verification must be replaced
-/+ resource "aws_route53_record" "domain_verification" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_amazonses.example.com.map-dev.byu.edu" -> (known after apply)
      ~ id              = "Z00268831ZKN0G19PUG6G__amazonses.example.com_TXT" -> (known after apply)
      ~ name            = "_amazonses.example.com" -> "_amazonses.map-dev.byu.edu" # forces replacement
        records         = [
            "djKo4EckxXs8ggtX/r/W/B9laHacIu8x5fKQWjtoiKc=",
        ]
        ttl             = 600
        type            = "TXT"
        zone_id         = "Z00268831ZKN0G19PUG6G"
    }

  # module.app.aws_route53_record.secondary_url_4a[0] will be created
  + resource "aws_route53_record" "secondary_url_4a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "maps-dev.byu.edu"
      + type            = "AAAA"
      + zone_id         = "Z00268831ZKN0G19PUG6G"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-us-west-2.amazonaws.com"
          + zone_id                = "Z3BJ6K6RIION7M"
        }
    }

  # module.app.aws_route53_record.secondary_url_a[0] will be created
  + resource "aws_route53_record" "secondary_url_a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "maps-dev.byu.edu"
      + type            = "A"
      + zone_id         = "Z00268831ZKN0G19PUG6G"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-us-west-2.amazonaws.com"
          + zone_id                = "Z3BJ6K6RIION7M"
        }
    }

  # module.app.aws_s3_bucket.secondary_site[0] will be updated in-place
  ~ resource "aws_s3_bucket" "secondary_site" {
        acl                         = "private"
        arn                         = "arn:aws:s3:::maps-dev.byu.edu"
        bucket                      = "maps-dev.byu.edu"
        bucket_domain_name          = "maps-dev.byu.edu.s3.amazonaws.com"
        bucket_regional_domain_name = "maps-dev.byu.edu.s3.us-west-2.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z3BJ6K6RIION7M"
        id                          = "maps-dev.byu.edu"
        region                      = "us-west-2"
        request_payer               = "BucketOwner"
      ~ tags                        = {
          + "app"              = "campus-map-ui-dev"
          + "data-sensitivity" = "public"
          + "env"              = "dev"
          + "repo"             = "https://github.com/byu-oit/campus-map-ui"
          + "team"             = "OIT-BYU-APPS-CUSTOM"
        }
        website_domain              = "s3-website-us-west-2.amazonaws.com"
        website_endpoint            = "maps-dev.byu.edu.s3-website-us-west-2.amazonaws.com"

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 10 -> null
          - enabled                                = true -> null
          - id                                     = "AutoAbortFailedMultipartUpload" -> null
          - tags                                   = {} -> null
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }

        website {
            redirect_all_requests_to = "map-dev.byu.edu"
        }
    }

  # module.app.aws_s3_bucket.static-website will be updated in-place
  ~ resource "aws_s3_bucket" "static-website" {
        acl                         = "private"
        arn                         = "arn:aws:s3:::campus-map-ui-dev-dev-s3staticsite"
        bucket                      = "campus-map-ui-dev-dev-s3staticsite"
        bucket_domain_name          = "campus-map-ui-dev-dev-s3staticsite.s3.amazonaws.com"
        bucket_regional_domain_name = "campus-map-ui-dev-dev-s3staticsite.s3.us-west-2.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z3BJ6K6RIION7M"
        id                          = "campus-map-ui-dev-dev-s3staticsite"
        region                      = "us-west-2"
        request_payer               = "BucketOwner"
      ~ tags                        = {
          + "app"              = "campus-map-ui-dev"
          + "data-sensitivity" = "public"
          + "env"              = "dev"
          + "repo"             = "https://github.com/byu-oit/campus-map-ui"
          + "team"             = "OIT-BYU-APPS-CUSTOM"
        }
        website_domain              = "s3-website-us-west-2.amazonaws.com"
        website_endpoint            = "campus-map-ui-dev-dev-s3staticsite.s3-website-us-west-2.amazonaws.com"

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 10 -> null
          - enabled                                = true -> null
          - id                                     = "AutoAbortFailedMultipartUpload" -> null
          - tags                                   = {} -> null
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }

        website {
            index_document = "index.html"
        }
    }

  # module.app.aws_s3_bucket_policy.static_website_read_with_secret will be updated in-place
  ~ resource "aws_s3_bucket_policy" "static_website_read_with_secret" {
        bucket = "campus-map-ui-dev-dev-s3staticsite"
        id     = "campus-map-ui-dev-dev-s3staticsite"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - aws:UserAgent = "Q5Ukg9tI3OzgGIpP"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::campus-map-ui-dev-dev-s3staticsite/*"
                      - Sid       = "1"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.app.aws_ses_domain_identity_verification.example_verification will be created
  + resource "aws_ses_domain_identity_verification" "example_verification" {
      + arn    = (known after apply)
      + domain = "map-dev.byu.edu"
      + id     = (known after apply)
    }

Plan: 16 to add, 7 to change, 4 to destroy.
Releasing state lock. This may take a few moments...
```